/**
  **********************************  STC89C52  ********************************
  * @文件名     ： Led.asm 
  * @作者       ： 佘晓凯 
  * @文件版本   ： V1.0.0 
  * @日期       ： 2018年02月10日 
  * @摘要       ： 按键部分 
  ******************************************************************************/
/*----------------------------------------------------------------------------
  更新日志:
  2018-02-10 V1.0.0:完成基本部分 
  ----------------------------------------------------------------------------*/

/* 包含的头文件 --------------------------------------------------------------*/
$INCLUDE	(Main.inc)
LED_ASM 	SEGMENT		CODE
RSEG		LED_ASM

PUBLIC LED

/************************************************
函数名称 ： Led
功    能 ： 每500ms根据当前模式改变状态 
作    者 ： 佘晓凯；
使用缓存 ： R2、R3、MODE 
摘    要 ： 无			
	
*************************************************/
LED:
		MOV		A	,	MODE
		
MODE1:	
		CJNE	A	,	#01H	,	MODE2		;如果为模式1
		MOV		A	,	R3			
		XRL		P2	,	A						;当前端口取反 
		SJMP	LEDRETURN
MODE2:	
		CJNE	A	,	#02H	,	LEDRETURN	;如果为模式2
		JB		MODE2LOR	,	MOD2R
MOD2l:	MOV		A	,	R2						;左移 
		RL		A								
		MOV		R2	,	A
		MOV		P2	,	A
		SJMP	LEDRETURN
MOD2R:	MOV		A	,	R2						;右移 
		RR		A
		MOV		R2	,	A		
		MOV		P2	,	A
		SJMP	LEDRETURN
		
LEDRETURN:
		RET
		
		END