/**
  **********************************  STC89C52  ********************************
  * @文件名     ： Delay.asm 
  * @作者       ： 佘晓凯 
  * @文件版本   ： V1.0.0 
  * @日期       ： 2018年02月10日 
  * @摘要       ： 延时函数 
  ******************************************************************************/
/*----------------------------------------------------------------------------
  更新日志:
  2018-01-25 V1.0.0:
  ----------------------------------------------------------------------------*/

/* 包含的函数 ----------------------------------------------------------------*/
PUBLIC  DELAY2MS,DELAY10MS

DELAY_ASM 	SEGMENT		CODE
RSEG		DELAY_ASM


;延时2ms
DELAY2MS:			;@12.000MHz	6T
	PUSH 	30H
	PUSH 	31H
	MOV 	30H	,	#8
	MOV 	31H	,	#192
NEXT:
	DJNZ 	31H	,	NEXT
	DJNZ 	30H	,	NEXT
	POP 	31H
	POP 	30H
	RET

;延时10ms用于按键去抖 
DELAY10MS:   
	PUSH 	30H
	PUSH 	31H
    MOV 	31H	,	#0D7H
DL0:
    MOV 	30H	,	#2DH
    DJNZ 	30H	,	$
    DJNZ 	31H	,	DL0
	POP 	31H
	POP 	30H
    RET

END